{
    "1": {
        "id":1,
        "title":"# Once Upon A Williams",
        "body":"I'm getting married! Those of you who know me personally already know that. On the one year anniversary of our relationship, I proposed to Courtney at JC Nichols Memorial Fountain, her favorite fountain in Kansas City (her hometown). Let me tell you the story.\r\n\r\n## We Meet\r\n\r\nI met Courtney through an online dating platform called Plenty of Fish. At the time, I was bored and not on the site really looking for anything because of the many women that are on there. Many of them were either promiscuous, unintelligent, vulgar, and many time all of the above. Then I get a notification that someone has \"favorited\" (Plenty of Fish's version of the like button) my account.\r\n\r\nI went to see who this person was. I seen the photos and immediately I was captured by the beauty of this person, I read her profile and was even more intrigued, so I sent her a message to start up a simple conversation. About an hour or so later she messaged me back, and the conversation began.\r\n\r\nWithin only a few days our conversations lasted hours upon hours. We talked about things like our relationship with God, our hopes and dreams, our goals for our life, what we were looking for in a relationship, etc. Then I told her the one thing that usually runs women off, \"I'm celibate. I'm not having sex until marriage\". to my amazement she was too.\r\n\r\nAs time went on we talked more and more. One day we fell asleep on the phone, and every since that day we've fallen asleep on the phone nonstop. She lives in Kansas City, Missouri, I live in St. Louis, Missouri, between us is about 245 miles. Throughout the year we traveled constantly to visit each other. She has formed a great relationship with my family, even attending a family reunion to meet more of the family, and I have a great relationship with her family as well. Within only a few months, I knew she was the woman I wanted to spend the rest of my life with, but I took more time to finalize my decision.\r\n\r\n## The Proposal\r\n\r\nThe planning for the proposal started about 4 months before the date of our anniversary and it was tough to plan and organize but I had a lot of help from her friends. Through them I found out what her favorite spot was in the city. They also helped me gather her family and other friends to be at the location when I took the knee. I knew she loved Mexican food so I made a reservation at a great Mexican restaurant within Kansas City called Zocalo's Mexican Cuisine.\r\n\r\nBefore we went to start the night, we had made plans for her father and I to meet. I get his and his wife's house, and their hospitality was great, in which made me less nervous than I was. Her father and I talked about football until he asked her to get him something from his room upstairs, which gave us some time to talk.\r\n\r\nWe talked a little before I asked for his blessing to marry his daughter. He lit up! Gave me his blessing and then spoke about how happy he was, and when the proposal is going to happen. I told him tonight and I want everyone who could be there to be there. He said, \"I'll be there.\"\r\n\r\nThe night went great. First we went to see a movie, the second Jack Reacher, very romantic, I know. After the movie we had a little time for before our dinner reservations so we took a walk. By the way, she knew none of our plans, the whole day was a surprise.\r\n\r\nOn our walk, we came by horse carriages and decided to take a ride through the Plaza area. During the ride we went past the Mexican Restaurant I had reservations for and she says, \"I would really like to go there.\" I said nothing and smiled. The ride ended and we went to the car to get our anniversary gifts for each other. The whole time I was also in communications with her friends telling them where to be and what time.\r\n\r\nDinner was awesome, we both had Southern Chicken Tacos. It was this amazing yet weird combination of Chicken tacos with Collard Greens. We exchanged gifts. She gave me a nice button down shirt, some new shoes, and a coffee-pot. She didn't know where we were exchanging gifts beforehand. I gave her a <span class=\"tooltip\">couples watchset, and a planner<span class=\"tooltip-text\">Later she said, \"Did this mean, time to plan? I said yeah, but it really was because she said she really needed them a while back.\"</span></span>.\r\n\r\nBefore we left for dinner, her friends had messaged me that they were all in place and everyone was in attendance and accounted for. So, I told it was time to go. We took our gifts back to the car and then took a walk to the park. Along the way, she had to use the restroom, so we stopped.\r\n\r\nI started getting messages from everyone, \"Where are you?\" She took a while looking at things in the store we stopped at. Okay, I was looking at stuff in the store we stopped at and she looked a little too. Then we started our walk again.\r\n\r\nWe get to the park and start to walk towards the fountain. I recognized that all her family and friends were only about 15 feet away from us but she didn't even pay attention to them being there. I grabbed her hand nervously, looked her in the eye and said, \"You know I love you right?\". She immediately started crying I got down on a knee, and her family and friends ran over, and she just walked away about 5 feet crying. I was still on the ground, I was there for a little while until she walked back over. I said, \"Courtney [leaving middle name out] James, will you marry me?\" She said, \"Of course.\"\r\n\r\n## Conclusion\r\n\r\nThis project is the website I built for our wedding and guest registration. It symbolizes the love that we have for one another and countdowns to the day where the two become one. I love you babe and can't wait to spend my life with you.\r\n\r\n<p>View the website: <a href=\"http://onceuponawilliams.com\" target=\"_blank\">#OnceUponAWilliams</a></p>",
        "slug":"once-upon-a-williams",
        "image":"1500933466.jpg",
        "alt":"Courtney & Elijah",
        "created_at":"2017-01-29 21:51:01",
        "updated_at":"2017-07-24 16:57:46"
    },
    "2": {
        "id":2,
        "title":"# Wikipedia Search API",
        "body":"Recently I have been going through the Intermediate portion of [freeCodeCamp](https://freecodecamp.com)'s Front End Development section. This section is heavily focused on getting comfortable with using multiple APIs. These APIs have included Local weather APIs, Twitch.tv, and Wikipedia.\r\n\r\nMy focus with going through the course material of freeCodeCamp is fairly simple, to be better at what I do. Their Front End course is pretty extensive and can seem daunting at times. The Front End section has a lot of focus on practicing algorithms and thinking through solutions. I've gone though other online coding course tools and I can truly say, of the ones I've been through freeCodeCamp is the most extensive.\r\n\r\nSo, with all that said, try out my tool below. \r\n\r\n<p data-height=\"265\" data-theme-id=\"dark\" data-slug-hash=\"XgNzOz\" data-default-tab=\"result\" data-user=\"ewillstudios\" data-embed-version=\"2\" data-pen-title=\"Wikipedia Search API\" class=\"codepen\">See the Pen <a href=\"https://codepen.io/ewillstudios/pen/XgNzOz/\">Wikipedia Search API</a> by Elijah Williams (<a href=\"https://codepen.io/ewillstudios\">@ewillstudios</a>) on <a href=\"https://codepen.io\">CodePen</a>.</p>\r\n<script async src=\"https://production-assets.codepen.io/assets/embed/ei.js\"></script>\r\n\r\n<br /><br />",
        "slug":"wiki-search-api",
        "image":"1497808644.png",
        "alt":"Wikipedia Search API",
        "created_at":"2017-06-18 12:41:57",
        "updated_at":"2017-06-18 13:08:13"
    }
}